package sec02.exam01;

public class Exam {

	public static void main(String[] args) {

		P3_1 p3_1 = new P3_1();

		// ( )강제형변환
		// 부모타입으로 형변환 가능
		// P2_1 p2_1 =(P2_1 )p3_1;
		// 이 경우에 형변환 연산자를 생략할수 있다 . 그래서
		// P2_1 p2_1 =(P2_1 )p3_1; 를
		// 밑에 처럼 쓸 수 있다.
		P2_1 p2_1 = (P2_1) p3_1;

		// P1 p1 = (P1)p2_1;
		// (P1) 생략가능
		P1 p1 = p2_1;

		// 형변환이 p2였다가 p1으로 된거임
		p1 = p3_1;
		p1 = (P2_1)p3_1;
		p1 = (P1)( (P2_1) p3_1 );

		
		// new도 가능하다.
		// P1 pp1 = (P1) ( (P2_1_) new P3_1( ) );
		P1 pp1 = new P3_1();

		// 2_1을 부모형태로 바꾼거 
		P1 p1_2 = new P2_2( );
		
		// 타입이 같으니까 된다
		pp1= p1_2;
	}

}
