package chap05;

public class 문제풀기1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
/*문제 풀기*/
		
		// 배열의 예 { 1.5.2.4}
		// 1. 배열뒤집기   {4.2.5.1로}
//			int [ ] a= {1,5,2,4};
//			int [ ] a1= new int [a. length];
//			for (int i=0, j=3; i<a1. length;
//					i++,  j-- {
//						a1 [0] =a[3]
//						
//					}
//					
			
			
			
			
					
				
		
				
			
			
			
			
			
			
//			a1[0]=4;
//			a1[1]=2;
//			a1[2]=5;
//			a1[3]=1;
//			
					
		
			
		
		
		
		
		// 2.첫번째 자리에 0넣기 : {0.1.5.2.4.}
		
		// 3.마지막 숫자를 첫번째에 넣기 (회전하는 느낌) : {4.1.5.2} 
		
		//배열의 예 : {3.4.7.5.1.4.6.4.5}
		// 4. 홀수 짝수의 각각 개수를 출력
		//( 배열의 갯수를 좀 늘려서)
		
		//5.주어진 수 (예를 들어 4)보다 큰 숫자의 개수
		
		//6.두번째 최대값

		//7. 내림차순으로 정렬(큰수부터 작은수 순으로)
		
		//로또 6개 번호(1~45)
		//8. 중복되지 않게 숫자 선정
		
		//9.자리 예약
		//자리가 10개 있는 소극장 예약 시스템을 만들자
		//1~10번까지 번호의 자리가 있음
		//예약할 자리는? 하고 입력받음
		//1-1예약이 가능하면 "예약했습니다"
		//1-2예약 불가능하면 "이미 예약 되어있습니다"
		//3모든 자리의 예약한 가능 여부 출력
		//4 예약가능한 자리만 출력
		
		//10. 임시비밀번호 8자리 만들기
		//1) 모두 다 숫자로 
		//2) 모두 다 소문자로 (힌트는 char ascii)
		//3) 숫자 2개 이상, 대문자 1개 이상, 소문자 1개이상
	}

}
